Revit 2027 API
ParameterTypeId.MaterialArea Property
 "Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialArea { get; }
Public Shared ReadOnly Property MaterialArea As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialArea {
	ForgeTypeId^ get ();
}
static member MaterialArea : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace